InformationRegisters/МаксимальныйРазмерЕжемесячнойСтраховойВыплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>МаксимальныйРазмерЕжемесячнойСтраховойВыплаты</Name>
			<Comment>4D</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Comment>4D</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОднократныйРазмер</Name>
					<Comment>4D</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МаксимальныйРазмерЕжемесячнойСтраховойВыплаты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////
/// Первоначальное заполнение и обновление информационной базы.

Процедура НачальноеЗаполнение() Экспорт
	
	Если ОбменДаннымиПовтИсп.ЭтоАвтономноеРабочееМесто() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьМаксимальныеРазмерыЕжемесячнойСтраховойВыплаты();
	
КонецПроцедуры

// Процедура заполняет максимальные размеры ежемесячной страховой выплаты по данным.
// Федерального закона N219-ФЗ от 03.12.2012.
Процедура ЗаполнитьМаксимальныеРазмерыЕжемесячнойСтраховойВыплаты() Экспорт
	
	// 4D:ERP для Беларуси, Юлия, 12.09.2017 10:25:45 
	// Редактировать РС "Максимальный размер ежемесячной страховой выплаты", № 15955
	// {
	НаборЗаписей = РегистрыСведений.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20170101';
	НоваяСтрока.Размер = 720.7*3;
	НоваяСтрока.ОднократныйРазмер = 720.7;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20170201';
	НоваяСтрока.Размер = 716.5*3;
	НоваяСтрока.ОднократныйРазмер = 716.5;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20170301';
	НоваяСтрока.Размер = 770.6*3;	
	НоваяСтрока.ОднократныйРазмер = 770.6;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20170401';
	НоваяСтрока.Размер = 776.7*3;
	НоваяСтрока.ОднократныйРазмер = 776.7;
		
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20170501';
	НоваяСтрока.Размер = 795.2*3;
	НоваяСтрока.ОднократныйРазмер = 795.2;
		
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20170601';
	НоваяСтрока.Размер = 819.3*3;
	НоваяСтрока.ОднократныйРазмер = 819.3;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20170701';
	НоваяСтрока.Размер = 827.5*3;
	НоваяСтрока.ОднократныйРазмер = 827.5;
	
	НаборЗаписей.Записать();
	// }
	// 4D
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
